Tester/src/Catalogs/Exchange/Exchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Exchange</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DateLoad</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateUnload</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMailUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeTransport</name>
    <type>
      <types>EnumRef.ExchangeTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>FileMessage</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MaximumErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Node</name>
    <type>
      <types>ExchangePlanRef.Full</types>
    </type>
  </attributes>
  <attributes>
    <name>NumbersOfErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PassiveModeFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PasswordEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.ExchangePeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPUnLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortIncoming</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortOutgoing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PrefixFileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Protocol</name>
    <type>
      <types>EnumRef.Protocols</types>
    </type>
  </attributes>
  <attributes>
    <name>SendedEMailError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SendEMailErrors</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerIncoming</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerOutgoing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerTimeOut</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Update</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAutomatic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UserEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseSSLIncoming</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSSLOutgoing</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseStandartFTPClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Receivers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Enums/ExchangeTransport/ExchangeTransport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeTransport</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>NetworkDisk</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Enums/ExchangePeriodicity/ExchangePeriodicity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangePeriodicity</name>
  <enumValues>
    <name>Daily</name>
  </enumValues>
  <enumValues>
    <name>Weekly</name>
  </enumValues>
  <enumValues>
    <name>Monthly</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>Yearly</name>
  </enumValues>
  <enumValues>
    <name>Constant</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Enums/Protocols/Protocols.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Protocols</name>
  <enumValues>
    <name>POP3</name>
  </enumValues>
  <enumValues>
    <name>IMAP</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/Exchange/Forms/Form/Module.bsl
&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	fillNodeData ( ThisObject, CurrentObject.Node );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif;
	fillAttributes ();
	AppearanceSrv.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure fillNew ()	
	
	Object.ExchangeTransport = Enums.ExchangeTransport.NetworkDisk; 
	Object.UseAutomatic = true;
	Object.Periodicity = Enums.ExchangePeriodicity.Constant;
	Object.Update = false;
	Object.NumbersOfErrors = 3;
	Object.PrefixFileName = "";
	Object.ServerTimeOut = 10;
	Object.Protocol = Enums.Protocols.IMAP;
	Object.UseStandartFTPClient = true;
	Object.UseSSLIncoming = false;
	setPortIncoming ( Object );
	Object.UseSSLOutgoing = false;
	setPortOutgoing ( Object );
	
EndProcedure

&AtServer
Procedure fillAttributes ()
	
	TypeExchange = ? ( Object.UseAutomatic, 2, 1 );
	ThisNode = getThisNode ( Object.Node );
	
EndProcedure 

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	if ( ValueIsFilled ( CurrentObject.Node ) and CurrentObject.Ref.IsEmpty () ) then
		Cancel = checkNode ( CurrentObject.Node );
	endif;
	
EndProcedure

&AtServer
Function checkNode ( Node )
	
	s = "
	|select Ref as Ref
	|from Catalog.Exchange
	|where Node = &Node
	|";
	q = new Query ( s );
	q.SetParameter ( "Node", Node );		
	result = q.Execute ();
	if ( result.IsEmpty () ) then
		error = false
	else
		error = true;
		Output.ExchangeDataItemAlreadyExist ( new Structure ( "Code", Node.Code ) );
	endif;
	return error; 
		
EndFunction

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	Appearance.Apply ( ThisObject );

EndProcedure

&AtClient
Procedure ExchangeTransportOnChange ( Item )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClient
Procedure TypeExchangeOnChange ( Item )
	
	Object.UseAutomatic = ? ( TypeExchange = 2, true, false );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClient
Procedure NodeOnChange ( Item )
	
	Object.Code = getCodeNode ( Object.Node );
	ThisNode = getThisNode ( Object.Node );
	if ( ThisNode ) then
		Output.SelectThisNode ();
	endif; 
	Appearance.Apply ( ThisObject );
	fillNodeData ( ThisObject, Object.Node ); 
	
EndProcedure

&AtServerNoContext
Function getCodeNode ( Node )
	
	if ( ValueIsFilled ( Node ) ) then
		code = Node.Code;
	else
		code = "";
	endif; 
	return code; 
	
EndFunction 

&AtClient
Procedure PathStartChoice ( Item, ChoiceData, StandardProcessing )
	
	selectDirectory ( Item.Name );
	
EndProcedure

&AtClient
Procedure selectDirectory ( Name )
	
	p = new Structure ( "Attribute", Name );
	LocalFiles.Prepare ( new NotifyDescription ( "OpenDialog", ThisObject, p ) );
	
EndProcedure 

&AtClient
Procedure OpenDialog ( Result, Params ) export
	
	dialog = new FileDialog ( FileDialogMode.ChooseDirectory );
	dialog.Directory = getDirectory ( Params.Attribute );
	dialog.Show ( new NotifyDescription ( "SetAttribute", ThisObject, Params ) );
	
EndProcedure 

&AtClient
Function getDirectory ( Attribute )
	
	path = Object [ Attribute ];
	directory = "";
	if ( path = "" ) then
		return directory;
	endif; 
	c = StrLen ( path );
	while c > 0 do
		if ( Mid ( path, c, 1 ) = "\" ) then
			directory = Mid ( path, 1, ( c - 1 ) );
			break;
		endif; 
		c = c - 1;		
	enddo;
	return directory; 

EndFunction

&AtClient
Procedure SetAttribute ( Result, Params ) export
	
	if ( Result = undefined ) then
		return;
	endif; 
	Object [ Params.Attribute ] = Result [ 0 ];
	Modified = true;
	
EndProcedure

&AtClient
Procedure PrefixFileNameOnChange ( Item )
	
	Output.ChangePrefixFileName ();
	
EndProcedure

&AtClient
Procedure UseSSLOutgoingOnChange ( Item )
	
	setPortOutgoing ( Object );	
	
EndProcedure

&AtClientAtServerNoContext
Procedure setPortOutgoing ( Object )
	
	if ( Object.UseSSLOutgoing ) then
		Object.PortOutgoing = 465;
	else
		Object.PortOutgoing = 25;
	endif; 
	
EndProcedure

&AtClient
Procedure ProtocolOnChange ( Item )
	
	setPortIncoming ( Object );
	
EndProcedure

&AtClient
Procedure UseSSLIncomingOnChange ( Item )
	
	setPortIncoming ( Object );
	
EndProcedure

&AtClientAtServerNoContext
Procedure setPortIncoming ( Object )
	
	if ( Object.Protocol = PredefinedValue ( "Enum.Protocols.IMAP" ) ) then
		if ( Object.UseSSLIncoming ) then
			Object.PortIncoming = 993;
		else
			Object.PortIncoming = 143;
		endif; 
	elsif ( Object.Protocol = PredefinedValue ( "Enum.Protocols.POP3" ) ) then
		if ( Object.UseSSLIncoming ) then
			Object.PortIncoming = 995;
		else
			Object.PortIncoming = 110;
		endif; 
	endif;	
	
EndProcedure

&AtClient
Procedure TestConnectionCommand ( Command )
	
	testConnection ();
	
EndProcedure 

&AtClient
Procedure testConnection ()
	
	testConnectionSrv ();
	
EndProcedure

&AtServer
Procedure testConnectionSrv ()
	
	profile = getProfile ();
	email = new InternetMail ();
	protocol = getMailProtocol ( Object.Protocol );
	try
		email.Logon ( profile, protocol );
		Output.LogonSuccess ();
	except 
		Output.ErrorConnectEmailProfile ( new Structure ( "Error", ErrorDescription () ) );
	endtry;	
	
EndProcedure 

&AtServer
Function getProfile ()
	
	p = new InternetMailProfile ();
	p.User = TrimAll ( Object.UserEmail );
	p.Password = TrimAll ( Object.PasswordEmail );
	p.SMTPServerAddress = TrimAll ( Object.ServerOutgoing );
	p.SMTPUser = TrimAll ( Object.UserEmail );
	p.SMTPPassword = TrimAll ( Object.PasswordEmail );
	p.SMTPUseSSL = Object.UseSSLOutgoing;
	p.SMTPPort = Object.PortOutgoing;
	if ( Object.Protocol = PredefinedValue ( "Enum.Protocols.IMAP" ) ) then
		p.IMAPUser = TrimAll ( Object.UserEmail );
		p.IMAPPassword = TrimAll ( Object.PasswordEmail );
		p.IMAPPort = Object.PortIncoming;
		p.IMAPServerAddress = TrimAll ( Object.ServerIncoming );
		p.IMAPUseSSL = Object.UseSSLIncoming;
	else
		p.POP3Port = Object.PortIncoming;
		p.POP3ServerAddress = TrimAll ( Object.ServerIncoming );
		p.POP3UseSSL = Object.UseSSLIncoming;
	endif; 
	return p;
	
EndFunction

&AtServer  
Function getMailProtocol ( Protocol )
	
	if ( Protocol = PredefinedValue ( "Enum.Protocols.POP3" ) ) then
		p = InternetMailProtocol.POP3;
	elsif ( Protocol = PredefinedValue ( "Enum.Protocols.IMAP" ) ) then
		p = InternetMailProtocol.IMAP;
	else
		p = InternetMailProtocol.POP3;
	endif;
	return p;
	
EndFunction 

&AtServerNoContext
Function getThisNode ( Node )
	
	if ( ValueIsFilled ( Node ) ) then
		ThisNode = Node.ThisNode; 
	else
		ThisNode = false;
	endif;
	return ThisNode; 
	
EndFunction 

&AtClient
Procedure OnOpen ( Cancel )
	
	if ( ThisNode ) then
		Output.SelectThisNode ();
	endif;
	
EndProcedure

&AtClientAtServerNoContext
Procedure fillNodeData ( Form, Node )
	
	data = getNodeData ( Node );
	Form.ReceivedNo = data.ReceivedNo;
	Form.SentNo = data.SentNo;
	
EndProcedure

&AtServerNoContext
Function getNodeData ( Node )
	
	p = new Structure ();
	p.Insert ( "ReceivedNo", 0 );
	p.Insert ( "SentNo", 0 );
	if ( ValueIsFilled ( Node ) ) then
		s = "
		|select
		|	ReceivedNo as ReceivedNo,
		|	SentNo as SentNo
		|from               
		|	ExchangePlan.Full
		|where
		|	Ref = &Ref 
		|";
		q = new Query ( s );
		q.SetParameter ( "Ref", Node );		
		result = q.Execute ();
		selection = result.Select ();
		selection.Next ();
		p.ReceivedNo = selection.ReceivedNo;
		p.SentNo = selection.SentNo;
	endif; 
	return p; 
	
EndFunction
